"""
Вечеринка
Михаил планирует устроить грандиозную детскую вечеринку, и, чтобы не опростоволоситься, ему необходимо посчитать необходимое количество кусков торта, чтобы никто не ушел голодным. На вход программе подаются два числа - количество детей на вечеринке и количество кусков торта, которое предполагается на каждого ребенка. Нужно посчитать, сколько всего кусков торта необходимо купить, чтобы хватило всем детям и вывести результат в следующем формате:

Вот столько кусков торта предполагается - число-результат
"""

a = int(input())
b = int(input())
print("Вот столько кусков торта предполагается - " + str(a * b))