"""
Здороваемся
На вход программе подаются имя пользователя и его возраст, каждое значение на отдельной строке. Далее необходимо поздороваться с пользователем по имени и указать, сколько ему лет
"""

name = input()
age = input()
print("Привет, " + name)
print("Тебе " + age + " лет")