"""
Русские народные забавы
Заяц, лисичка и волк решили в качестве собственного увеселения  вспомнить традиционные русские забавы и поводить хоровод, но чтобы было повеселее - договорились каждый пригласить еще по сколько-то родственников, а организатором сделать Снегурочку, которая будет участвовать в каждом хороводе. Программе на вход подаются три числа - родственники зайца, не считая его самого, родственники лисички - вместе с ней самой и родственники волка, также без него самого. Нужно вывести одно число - сколько всего участников в результате будет принимать участие в хороводе.
"""

a = int(input())
b = int(input())
c = int(input())
print(1 + a + 1 + b + c + 1)