"""
Сумма
На вход программе подаются два числа, каждое на отдельной строке. Необходимо вывести сумму этих чисел.
"""

a = int(input())
b = int(input())
print(a + b)