"""
Вывод посерьезнее
Вам необходимо написать программу, которая выведет строку "AAA", повторенную 9 раз.
"""

a = "AAA"
b = 9
print(a*b)