"""
Первый вывод
Вам необходимо написать программу, которая выведет строку "Пам-пам-пам-пам". 
"""

print("Пам-пам-пам-пам")