"""
Вывод нескольких
Вам необходимо написать программу, которая будет выводить три числа - 78, 27 и 89 - на одной строке через пробел.
"""

print(78, 27, 89)