"""
Складываем
Вам нужно написать программу, которая выводит сумму чисел 56 и 13. Первый раз нужно сложить их как строки, а затем - как числа.
"""

print("56" + "13")
print(56 + 13)