"""
Let's check
На вход программе подаются два числа, каждое с новой строки, необходимо проверить эти числа на равенство и в случае его выполнения вывести "YES".
"""

a = int(input())
b = int(input())
if (a == b):
    print("YES")